![](anon.jpg)

- <b> lambda is an expression, not a statement. </b>
Because of this, a lambda can appear in places a def is not allowed. For example, places like inside a list literal, or a function call's arguments. As an expression, lambda returns a value that can optionally be assigned a name. <br> 
- In contrast, the def statement always assigns the new function to the name in the header, instead of returning is as a result. <br>
- <b> lambda's body is a single expression, not a block of statements. </b> <br>
- The lambda's body is similar to what we'd put in a def body's return statement. We simply type the result as an expression instead of explicitly returning it. <br>
- Because it is limited to an expression, a lambda is less general that a def. We can only squeeze design, to limit program nesting. lambda is designed for coding simple functions, and def handles larger tasks.

In [17]:
# example of standard python function

def myfunction(x, y, z):
    return x + y + z

myfunction(1,2,3)

6

In [18]:
# example of the same as a lambda function

f = lambda x, y, z: x + y + z

f(1,2,3)

6

<b> The lambda function as a callback hander and basis for `jump tables`: </b>

 - The lambdas can be used as a function shorthand that allows us to embed a function within the code. For instance, callback handlers are frequently coded as inline lambda expressions embedded directly in a registration call's arguments list. 
 - Instead of being defined with a `def` elsewhere in a file and referenced by name, lambdas are also commonly used to code jump tables which are lists or dictionaries of actions to be performed on demand.

In [19]:
# jump table example - this essentially amounts to a list of functions/operations

j = [lambda x: x**2, lambda x: x**3, lambda x: x**4]

for f in j: print f(10000)

100000000
1000000000000
10000000000000000

Let's use lambda functions on our 1880 Social Security Admin "baby names" dataset:

In [20]:
import pandas as pd
names1880 = pd.read_csv('~/Downloads/names/yob1880.txt', names = ['name', 'sex', 'births'])

In [21]:
names1880.head()

        name sex  births
0       Mary   F    7065
1       Anna   F    2604
2       Emma   F    2003
3  Elizabeth   F    1939
4     Minnie   F    1746

In [23]:
# Here an example of a function working with pandas' apply method

def checker(name):
    if name.endswith('a') or name.endswith('i') or name.endswith('n'):
        return "Miss"
    
names1880['title'] = names1880.name.apply(checker)
names1880.head()

        name sex  births title
0       Mary   F    7065  None
1       Anna   F    2604  Miss
2       Emma   F    2003  Miss
3  Elizabeth   F    1939  None
4     Minnie   F    1746  None

In [27]:
# same as a above but now as a lambda function
# note that the if else pattern must comply with the below
# we use pandas feature of instantaneous column mutation
# x[0] refers to the first letter of the name to be added to the first column

names1880['first'] = names1880.name.apply(lambda x:x[0] if x.startswith('M') else '')
names1880.head()

        name sex  births title first
0       Mary   F    7065  None     M
1       Anna   F    2604  Miss
2       Emma   F    2003  Miss
3  Elizabeth   F    1939  None
4     Minnie   F    1746  None     M

In [29]:
# example of a mathematical function applied to a column

def multi(x):
    return x*10
names1880['multiplier'] = names1880.births.apply(multi)
names1880.head()

        name sex  births title first  multiplier
0       Mary   F    7065  None     M       70650
1       Anna   F    2604  Miss             26040
2       Emma   F    2003  Miss             20030
3  Elizabeth   F    1939  None             19390
4     Minnie   F    1746  None     M       17460

In [33]:
# we drop the column just created to recreate it below via lambda

names1880.drop('multiplier', axis =1, inplace=True)
names1880.head()

        name sex  births title first
0       Mary   F    7065  None     M
1       Anna   F    2604  Miss
2       Emma   F    2003  Miss
3  Elizabeth   F    1939  None
4     Minnie   F    1746  None     M

In [36]:
# Exercise: Please write the multiplier function as a lambda function

names1880['multiplier'] = names1880.births.apply(lambda x:x*10)

# names1880['multiplier'] = names1880.births * 10 # this is also fine and very pythonic

names1880.head()

        name sex  births title first  multiplier
0       Mary   F    7065  None     M       70650
1       Anna   F    2604  Miss             26040
2       Emma   F    2003  Miss             20030
3  Elizabeth   F    1939  None             19390
4     Minnie   F    1746  None     M       17460